Revit 2027 API
ParameterTypeId.StructuralConnectionEditType Property
 "Modify Parameters"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId StructuralConnectionEditType { get; }
Public Shared ReadOnly Property StructuralConnectionEditType As ForgeTypeId
	Get
public:
static property ForgeTypeId^ StructuralConnectionEditType {
	ForgeTypeId^ get ();
}
static member StructuralConnectionEditType : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace